УчетВУправляющихДляГит1/src/Documents/ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП/ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрЗапроса</name>
    <comment>Идентификационный номер налогоплательщика или основной государственный регистрационный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПараметраЗапроса</name>
    <type>
      <types>EnumRef.ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Enums/ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП/ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП</name>
  <enumValues>
    <name>ИНН</name>
  </enumValues>
  <enumValues>
    <name>ОГРН</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(СообщениеОснование)
	
	Если РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("Справочники.Организации");
        Организация = Модуль.ОрганизацияПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ДлинаСтрокиИНН_ОГРН = СтрДлина(СокрЛП(ПараметрЗапроса));
	
	Если ДлинаСтрокиИНН_ОГРН = 13 ИЛИ ДлинаСтрокиИНН_ОГРН = 15 Тогда
		ТекстСообщения = "";
		Если Не РегламентированныеДанныеКлиентСервер.ОГРНСоответствуетТребованиям(ПараметрЗапроса, ?(ДлинаСтрокиИНН_ОГРН = 13, Истина, Ложь), ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,, "ПредставлениеЗапроса", "", Отказ);
		КонецЕсли;
	ИначеЕсли ДлинаСтрокиИНН_ОГРН = 10 ИЛИ ДлинаСтрокиИНН_ОГРН = 12 Тогда
		ТекстСообщения = "";
		Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ПараметрЗапроса, ?(ДлинаСтрокиИНН_ОГРН = 10, Истина, Ложь), ТекстСообщения) Тогда
			ТекстСообщения = ТекстСообщения + " " + НСтр("ru = 'Данный ИНН не существует.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,, "ПредставлениеЗапроса", "", Отказ);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Укажите верные параметры поиска ИНН или ОГРН.'"),, "ПредставлениеЗапроса", "", Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаСтрокиИНН_ОГРН = СтрДлина(СтрЗаменить(ПараметрЗапроса, " ", ""));
	
	Если ДлинаСтрокиИНН_ОГРН = 13 ИЛИ ДлинаСтрокиИНН_ОГРН = 15 Тогда
		ВидПараметраЗапроса = Перечисления.ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП.ОГРН;
	ИначеЕсли ДлинаСтрокиИНН_ОГРН = 10 ИЛИ ДлинаСтрокиИНН_ОГРН = 12 Тогда
		ВидПараметраЗапроса = Перечисления.ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП.ИНН;
	Иначе
		ВидПараметраЗапроса = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
